#+title: Decision Sprout

This project is aimed to learn the core topics in machine learning and decision trees. Any contributions for improvement are welcome.

*** Running the Project
#+begin_src sh :results output
make clean
make
./decision_tree
#+end_src

#+RESULTS:
#+begin_example
rm -rf build decision_tree
gcc -Wall -Wextra -std=c99 -g  -c src/dataset.c -o build/dataset.o
gcc -Wall -Wextra -std=c99 -g  -c src/main.c -o build/main.o
gcc -Wall -Wextra -std=c99 -g  -c src/tree.c -o build/tree.o
gcc -Wall -Wextra -std=c99 -g  -c src/utils.c -o build/utils.o
gcc -Wall -Wextra -std=c99 -g  -o decision_tree  build/dataset.o  build/main.o  build/tree.o  build/utils.o -lcsv
[Id, SepalLengthCm, SepalWidthCm, PetalLengthCm, PetalWidthCm, Species, ]
0 [1.000000, 5.100000, 3.500000, 1.400000, 0.200000, Iris-setosa, ]
1 [2.000000, 4.900000, 3.000000, 1.400000, 0.200000, Iris-setosa, ]
2 [3.000000, 4.700000, 3.200000, 1.300000, 0.200000, Iris-setosa, ]
Split the Data Set into Training (105) and Test (45)
Tree has been built using the training set
Predictions have been made
Calculating the accuracy... 
Accuracy: 0.93%
#+end_example

